---
kind: property
id: P:Autodesk.Revit.DB.BoundarySegment.ElementId
source: html/eaf7d628-d9c2-80a3-2fd7-00013bab1377.htm
---
# Autodesk.Revit.DB.BoundarySegment.ElementId Property

Retrieve the id of the element that produces this boundary segment.
 If the segment is created from an element in a link, this is the id of the RevitLinkInstance.

## Syntax (C#)
```csharp
public ElementId ElementId { get; }
```